Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: གང་དག་ཆོས་གང་ལ་འཛིན་པ་དང་། གཏོང་བ་དེ་དག་ནི་ཆོས་འདོད་པ་མ་ཡིན་ཏེ། དེ་དག་ནི་འཛིན་པ་དང་གཏོང་བ་འདོད་པའོ།
en: He who holds on to things or lets go of things is not interested in the Dharma but is interested in holding and letting go.

source: །ཆོས་ནི་ཀུན་གཞི་མེད་པ་སྟེ།
en: The Dharma is not a secure refuge.

source: །རྨ་མེད་པ་ལ་རྨ་མ་དབྱུང་ཤིག
en: do not wound those who are without wounds;

source: གང་ཀུན་གཞི་ལ་དགའ་བ་དེ་དག་ནི་ཆོས་འདོད་པ་མ་ཡིན་གྱི། དེ་དག་ནི་ཀུན་གཞི་འདོད་པའོ།
en: He who enjoys a secure refuge is not interested in the Dharma but is interested in a secure refuge.

source: །ཆོས་ནི་མཚན་མ་མེད་པ་སྟོང་པ་སྟེ།
en: The Dharma is without sign.

source: གང་དག་གི་རྣམ་པར་ཤེས་པ་མཚན་མའི་རྗེས་སུ་འཇུག་པ་དེ་དག་ནི་ཆོས་འདོད་པ་མ་ཡིན་ཏེ། དེ་དག་ནི་མཚན་མ་འདོད་པའོ།
en: He whose consciousness pursues signs is not interested in the Dharma but is interested in signs.

source: །ཆོས་ནི་ལྷན་ཅིག་གནས་པ་མ་ཡིན་ཏེ།
en: The Dharma is not a society.

source: །ལམ་ཆེན་པོར་འཇུག་པར་འདོད་པ་སྲང་དོག་པར་མ་གཟུད་ཅིག
en: do not impose a narrow path upon those who aspire to a great path;

source: གང་སུ་དག་ཆོས་དང་ལྷན་ཅིག་གནས་པ་དེ་དག་ནི་ཆོས་འདོད་པ་མ་ཡིན་གྱི། དེ་དག་ནི་གནས་པ་འདོད་པའོ།
en: He who seeks to associate with the Dharma is not interested in the Dharma but is interested in association.

source: །རྒྱ་མཚོ་ཆེན་པོ་བ་ལང་གི་རྨིག་རྗེས་སུ་མ་བླུགས་ཤིག
en: do not try to pour the great ocean into the hoof-print of an ox;

source: །ཆོས་ནི་མཐོང་བ་དང་། ཐོས་པ་དང་། བྱེ་བྲག་ཕྱེད་པ་དང་། རྣམ་པར་རིག་པ་མ་ཡིན་ཏེ།
en: The Dharma is not a sight, a sound, a category, or an idea.

source: །རི་རབ་ཡུངས་འབྲུའི་ནང་དུ་མ་གཞུག་ཤིག
en: do not try to put Mount Sumeru into a grain of mustard;

source: གང་དག་མཐོང་བ་དང་། ཐོས་པ་དང་། བྱེ་བྲག་ཕྱེད་པ་དང་། རྣམ་པར་རིག་པ་ལ་སྤྱོད་པ་དེ་དག་ནི་མཐོང་པ་དང་། ཐོས་པ་དང་། བྱེ་བྲག་ཕྱེད་པ་དང་། རྣམ་པར་རིག་པ་འདོད་པ་ཡིན་གྱི་དེ་དག་ནི་ཆོས་འདོད་པ་མ་ཡིན་ནོ།
en: He who is involved in sights, sounds, categories, and ideas is not interested in the Dharma but is interested in sights, sounds, categories, and ideas.

source: །ཉི་མའི་འོད་སྲིན་བུ་མེ་ཁྱེར་གྱིས་མ་བཟློག་ཤིག
en: do not confuse the brilliance of the sun with the light of a glowworm;

source: །སེང་གེའི་སྒྲ་སྒྲོགས་པར་འདོད་པ་རྣམས་ཝའི་སྒྲ་ལ་མ་གཟུད་ཅིག
en: and do not expose those who admire the roar of a lion to the howl of a jackal!

source: །བཙུན་པ་གང་པོ་དགེ་སློང་འདི་དག་ཐམས་ཅད་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ལས་བྱང་ཆུབ་ཀྱི་སེམས་སྟོར་བ་ཤ་སྟག་སྟེ།
en: “ ‘Reverend Pūrṇa, all these monks were formerly engaged in the Mahāyāna but have forgotten the spirit of enlightenment.

source: །ཉན་ཐོས་ཀྱི་ཐེག་པ་ནི་ཡང་དག་པ་མ་ཡིན་ཏེ།
en: The disciple vehicle is not ultimately valid,

source: སེམས་ཅན་གྱི་དབང་པོའི་རིམ་པ་ཤེས་པ་ལ་ཉན་ཐོས་འདི་དག་ནི་ཁོ་བོས་དམུས་ལོང་དང་འདྲ་བ་སྙམ་བྱེད་དོ།
en: and you disciples are like men blind from birth, in regard to recognition of the degrees of the spiritual faculties of living beings.’

source: །ཀུན་དགའ་བོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྤྱོད་ལམ་དང་། ལོངས་སྤྱོད་དང་།
en: Ānanda, among all the activities, enjoyments, and practices of the buddhas,

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་དེའི་ཚེ་ཇི་ལྟར་དགེ་སློང་དེ་དག་སྔོན་གྱི་གནས་རྣམ་པ་མང་པོ་རྗེས་སུ་དྲན་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས།
en: “At that moment, the Licchavi Vimalakīrti entered into such a concentration that those monks were caused to remember their various former lives,

source: དེ་དག་ལ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ཕྱིར་སངས་རྒྱས་ལྔ་བརྒྱ་ལ་བསྙེན་བཀུར་བྱས་པའི་དགེ་བའི་རྩ་བ་དང་ལྡན་པ་སྟེ།
en: in which they had produced the roots of virtue by serving five hundred buddhas for the sake of perfect enlightenment.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་ཆོས་ནི་འདུས་བྱས་དང་འདུས་མ་བྱས་མེད་པ་སྟེ།
en: Reverend Śāriputra, the Dharma is free of compounded things and uncompounded things.

source: དེས་ཡང་དེ་དག་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པར་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་བསྟན་ནས།
en: He taught them the Dharma, and they all attained the stage of irreversibility from unexcelled, perfect enlightenment.

source: གང་དག་འདུས་བྱས་སྤྱོད་ཡུལ་བ་དེ་དག་ནི་ཆོས་འདོད་པ་མ་ཡིན་གྱི་དེ་དག་ནི་འདུས་བྱས་སུ་འཛིན་པ་འདོད་པའོ།
en: He who adheres to compounded things and uncompounded things is not interested in the Dharma but is interested in adhering to compounded things and uncompounded things.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་ཁྱོད་ཆོས་འདོད་པར་བྱ་ན་ཁྱོད་ཀྱིས་ཆོས་ཐམས་ཅད་མི་འདོད་པར་བྱའོ།
en: “Thereupon, reverend Śāriputra, if you are interested in the Dharma, you should take no interest in anything.”

source: །ཉན་ཐོས་ཀྱིས་ཕ་རོལ་གྱི་སེམས་དང་བསམ་པ་མ་བརྟགས་པར་སུ་ལ་ཡང་ཆོས་མི་བསྟན་ཏོ།
en: ‘The disciples, who do not know the thoughts or the inclinations of others, are not able to teach the Dharma to anyone.

source: །ཆོས་བསྟན་པ་འདི་བཤད་པ་ན་ལྷའི་བུ་ལྔ་བརྒྱ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་གོ།
en: When Vimalakīrti had spoken this discourse, five hundred gods obtained the purity of the Dharma-eye in viewing all things.

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་སྨྲས་པ།
en: Then, the Licchavi Vimalakīrti said to the crown prince, Mañjuśrī,

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཞིན་དུ་རྟག་ཏུ་མཉམ་པར་བཞག་པ་ཡང་མ་ལགས་སོ་སྙམ་བགྱིད་དེ།
en: and they are not always in a state of concentration like the Tathāgata, the arhat, the perfectly accomplished Buddha.’

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱའི་བུ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ།
en: The Buddha then said to the venerable Mahākātyāyana,

source: ཀཱ་ཏྱའི་བུ་ཁྱོད་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པའི་ནད་འདྲིར་སོང་ཤིག
en: “Kātyāyana, go to the Licchavi Vimalakīrti to inquire about his illness.”

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་ལུས་ཀྱང་དཔག་ཚད་འབུམ་ཕྲག་བཞི་བཅུ་རྩ་གཉིས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་སེང་གེའི་ཁྲི་ཡང་དཔག་ཚད་འབུམ་ཕྲག་སུམ་ཅུ་རྩ་བཞི་ཡོད་དེ།
en: The bodhisattvas there are forty-two hundred thousand leagues tall and their own thrones are thirty-four hundred thousand leagues high. ‌

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་གདམས་པ་མདོར་བཀའ་སྩལ་ཏེ།
en: after the Lord had given some brief instruction to the monks,

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ལྷུན་པོའི་སྒྲོན་མའི་རྒྱལ་པོ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ལྷུན་པོའི་རྒྱལ་མཚན་དེ་ན་སེང་གེའི་ཁྲི་ཐམས་ཅད་ཀྱི་མཆོག་ཡོན་ཏན་ཐམས་ཅད་དང་ལྡན་པ་དག་ཡོད་དོ།
en: Noble sir, the finest and most superb thrones exist in that universe Merudhvaja, which is the buddhafield of the Tathāgata Meru­pradīpa­rāja.”

source: །ཀུན་དགའ་བོ་འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོར་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: “Ānanda, this is a Dharma-door called introduction to all the buddha-qualities.

source: གང་ཕུང་པོ་ལྔ་པོ་དག་ལ་སྟོང་པ་ཉིད་དུ་རྟོགས་པས་སྐྱེ་བ་མེད་པ་རྟོག་པའི་དོན་དེ་ནི་སྡུག་བསྔལ་གྱི་དོན་ཏོ།
en: The meaning of the realization of birthlessness, through the realization of the voidness of the five aggregates, is the meaning of “suffering.”

source: །གང་བདག་དང་བདག་མེད་པ་གཉིས་སུ་མེད་པ་ཉིད་དེ་ནི་བདག་མེད་པའི་དོན་ཏོ།
en: The fact of the nonduality of self and selflessness is the meaning of “selflessness.”

source: །གང་རང་གི་ངོ་བོ་མེད་པ་དང་། གཞན་གྱི་ངོ་བོ་མེད་པ་དེ་ནི་མི་འབར་ཏེ།
en: That which has no intrinsic substance and no other sort of substance does not burn,

source: །བསྟན་པ་འདི་བཤད་པ་ན་དགེ་སློང་དེ་དག་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ།
en: “When he had discoursed thus, the minds of the monks were liberated from their defilements and entered a state of nongrasping.

source: །བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་བདག་ནི་སྐྱེས་བུ་དམ་པ་དེའི་བྲོ་འདྲི་ཞིང་མཆི་བར་མི་སྤྲོའོ།
en: Therefore, Lord, I am reluctant to go to that good man to inquire about his illness.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མ་འགགས་པ་ལ་བཀའ་སྩལ་པ།
en: The Buddha then said to the venerable Aniruddha,

source: །སེང་གེའི་ཁྲི་སྣ་ཚོགས་སུམ་ཁྲི་ཉིས་སྟོང་མ་འདོམ་པར་ཤོང་སྟེ། ཁྱིམ་དེ་ཡང་དེ་ཙམ་དུ་ཡངས་པར་སྣང་ངོ་།
en: The thirty-two hundred thousand thrones arranged themselves without crowding and the house seemed to enlarge itself accordingly.

source: །ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ཡང་བསྒྲིབས་པར་གྱུར་པ་མེད། འཛམ་བུའི་གླིང་དང་གླིང་བཞི་པ་ཡང་བསྒྲིབས་པ་མེད་དེ།
en: The great city of Vaiśālī did not become obscured; neither did the land of Jambudvīpa, nor the world of four continents.

source: །འཇམ་དཔལ་སེང་གེའི་ཁྲི་དང་འཚམ་པའི་ལུས་སུ་བྱིན་གྱིས་རློབས་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་དང་སེང་གེའི་ཁྲི་ལ་འདུག་ཤིག
en: “Mañjuśrī, let the bodhisattvas be seated on these thrones, having transformed their bodies to a suitable size!”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་གང་མངོན་པར་ཤེས་པ་ཐོབ་པ་དེ་དག་ནི་བདག་གི་ལུས་དཔག་ཚད་འབུམ་ཕྲག་བཞི་བཅུ་རྩ་གཉིས་པར་བྱིན་གྱིས་བརླབས་ཏེ་སེང་གེའི་ཁྲི་ལ་འཁོད་དོ།
en: Then, those bodhisattvas who had attained the superknowledges transformed their bodies to a height of forty-two hundred thousand leagues and sat upon the thrones.

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ལས་དང་པོ་པ་དེ་དག་ནི་སེང་གེའི་ཁྲི་དེ་དག་ལ་འདུག་མ་ནུས་སོ།
en: But the beginner bodhisattvas were not able to transform themselves to sit upon the thrones.

source: །གྲོགས་པོ་དག་ཁོ་བོས་ནི་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ནི་འདི་ལྟ་སྟེ།
en: ‘Friends, I see the entire billion-world galactic universe of the Lord Śākyamuni

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་མངོན་པར་ཤེས་པ་ལྔ་འགྲུབ་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟ་བུར་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་ཆོས་བསྟན་ཏེ།
en: Then, the Licchavi Vimalakīrti taught these beginner bodhisattvas a teaching that enabled them to attain the five superknowledges,

source: དེ་དག་གིས་མངོན་པར་ཤེས་པ་ཐོབ་ནས་ལུས་དཔག་ཚད་འབུམ་ཕྲག་བཞི་བཅུ་རྩ་གཉིས་པར་མངོན་པར་སྤྲུལ་ཏེ་སེང་གེའི་ཁྲི་དེ་དག་ལ་འཁོད་དོ།
en: and, having attained them, they transformed their bodies to a height of forty-two hundred thousand leagues and sat upon the thrones.

source: །ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཀྱང་སེང་གེའི་ཁྲི་དེ་དག་ལ་འཁོད་མ་ནུས་ཏེ།
en: But still the great disciples were not able to seat themselves upon the thrones.

source: །བཙུན་པ་མ་འགགས་པ་ཁྱོད་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་མིག་ཅན་གྱི་མཆོག་ཏུ་གསུངས་ན།
en: ‘Reverend Aniruddha, you have been proclaimed by the Buddha to be the foremost among those who possess the divine eye.

source: བདག་གི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་བགྱིས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དེ་བདག་ལ་འདི་སྐད་ཅེས་མཆིའོ།
en: having bowed their heads at my feet, withdrew to one side and asked me,

source: །དེ་ནས་ཉན་ཐོས་ཆེན་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ལྷུན་པོའི་སྒྲོན་མའི་རྒྱལ་པོ་དེ་ལ་ཕྱག་འཚལ་ནས་གདོད་དེ་དག་སེང་གེའི་ཁྲི་ལ་འཁོད་དོ།
en: Then, the great disciples bowed down to the Tathāgata Meru­pradīpa­rāja and they were seated upon the thrones.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then, the venerable Śāriputra said to the Licchavi Vimalakīrti,

source: །བཙུན་པ་མ་འགགས་པའི་ལྷའི་མིག་མངོན་པར་འདུ་བྱེད་པའི་མཚན་ཉིད་དམ།
en: ‘Reverend Aniruddha, is your divine eye compounded in nature?

source: འོན་ཏེ་མངོན་པར་འདུ་མི་བྱེད་པའི་མཚན་ཉིད་ཡིན།
en: Or is it uncompounded in nature?

source: དེ་གལ་ཏེ་མངོན་པར་འདུ་བྱེད་པའི་མཚན་ཉིད་ཡིན་ན་ནི་ཕྱི་རོལ་གྱི་མངོན་པར་ཤེས་པ་ལྔ་དང་མཚུངས་སོ།
en: If it is compounded in nature, it is the same as the superknowledges of the outsiders.

source: །ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་སྨྲས་པ།
en: The Licchavi Vimalakīrti replied,

source: བཙུན་པ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ནི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Reverend Śāriputra, for the tathāgatas and the bodhisattvas, there is a liberation called ‘inconceivable.’

source: རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་རིའི་རྒྱལ་པོ་རི་རབ་དེ་ཙམ་དུ་མཐོ་བ། དེ་ཙམ་དུ་ཆེ་བ། དེ་ཙམ་དུ་འཕགས་པ། དེ་ཙམ་དུ་ཡངས་པ་ཡང་ཡུངས་འབྲུའི་ནང་དུ་འཇུག་སྟེ།
en: The bodhisattva who lives in the inconceivable liberation can put the king of mountains, Sumeru, which is so high, so great, so noble, and so vast, into a mustard seed.

source: །དེ་ནི་བཙུན་པ་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་ལ་འཇུག་པའོ།
en: That, reverend Śāriputra, is an entrance to the domain of the inconceivable liberation of the bodhisattvas.

source: །རྫུ་འཕྲུལ་གྱིས་འདུལ་བའི་སེམས་ཅན་གཞན་དག་གིས་ནི་རིའི་རྒྱལ་པོ་རི་རབ་དེ་ཡུངས་འབྲུའི་ནང་དུ་བཅུག་པར་ཤེས་ཤིང་མཐོང་ངོ་།
en: Only those beings who are destined to be disciplined by miracles see and understand the putting of the king of mountains, Sumeru, into the mustard seed.

source: ཡུངས་འབྲུ་དེ་ཡང་སྐྱེས་པ་ཡང་མེད། རི་རབ་ཀྱང་གང་བའང་མེད་ལ་བྱ་བ་དེ་ཡང་སྟོན་ཏོ།
en: He can perform this feat without enlarging the mustard seed and without shrinking Mount Sumeru.

source: །རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱང་བདག་ཅག་གང་དུ་བཅུག་མི་ཤེས་སོ།
en: And the deities of the assembly of the four Mahārājas and of the Trayastriṃśa heavens do not even know where they are.

source: །དེ་ལྟར་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་བཀོད་པ་རྣམས་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ཏུ་སྟོན་ཏོ།
en: “Thus, a bodhisattva who lives in the inconceivable liberation can manifest all the splendors of the virtues of all the buddhafields within a single buddhafield.

source: །གང་འཁོར་བ་བསྟུང་བས་འདུལ་བའི་སེམས་ཅན་དེ་དག་ནི་བསྐལ་པ་ཡང་ཞག་བདུན་གྱིས་འདས་པར་ཤེས་སོ།
en: and those disciplined by a short period of evolution actually perceive an eon to be the passing of a week.

source: །དེ་ལ་འཁོར་བ་ཚད་མེད་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ནི་ཞག་བདུན་ལ་ཡང་བསྐལ་པ་འདས་པ་སྙམ་དུ་ཤེས་སོ།
en: The living beings who are disciplined through an immeasurable period of evolution actually perceive a week to be the passing of an eon,

source: འཁོར་བ་བསྟུང་བས་འདུལ་བ་དག་ཀྱང་ཡོད་དེ།
en: and there are also those who are disciplined after a short period of evolution.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་གཞན་ཡང་འཁོར་བ་ཚད་མེད་པས་འདུལ་བའི་སེམས་ཅན་དག་ཀྱང་ཡོད།
en: “Furthermore, reverend Śāriputra, there are beings who become disciplined after an immense period of evolution,

source: བྱ་བ་དེ་ཡང་སྣང་ཞིང་སེམས་ཅན་དེ་དག་ལ་གནོད་ཅིང་འཁྲུག་པར་གྱུར་པ་ཡང་མེད་དོ།
en: And the whole operation is visible without any injury or disturbance to any of those living beings.

source: ཉ་དང་། རུས་སྦལ་དང་། ཆུ་སྲིན་བྱིས་པ་གསོད་དང་། སྦལ་པ་དང་། ཆུ་ལས་སྐྱེས་པའི་སྲོག་ཆགས་གཞན་དག་ལ་ཡང་གནོད་པར་གྱུར་པ་མེད། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་རྣམས་ཀྱང་འདི་སྙམ་དུ་བདག་ཅག་གར་བཙུད་སྙམ་ཡང་མི་སེམས་ལ།
en: without injuring the water-animals such as fish, tortoises, crocodiles, frogs, and other creatures, and without the nāgas, yakṣas, gandharvas, and asuras even being aware of where they are.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་གཞན་ཡང་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་རྒྱ་མཚོ་ཆེན་པོ་བཞིའི་ཆུའི་ཕུང་པོ་རྣམས་བ་སྤུའི་ཁུང་བུ་གཅིག་ཏུ་བླུགས་ཏེ།
en: “Furthermore, reverend Śāriputra, the bodhisattva who lives in the inconceivable liberation can pour into a single pore of his skin all the waters of the four great oceans,

source: །ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམས་ལ་ཁྱོད་བཏང་སྙོམས་སུ་གྱིས་ཤིག
en: Ānanda, you should remain in equanimity with regard to the deeds of the bodhisattvas.

source: །ཉོན་མོངས་པ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་རིགས་ཏེ།
en: The passions do indeed constitute the family of the tathāgatas.

source: བདག་ཅག་ལྟ་བུས་ནི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའམ། སངས་རྒྱས་ཀྱི་ཆོས་ལ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ག་ལ་ནུས།
en: How can such as we, the disciples, conceive the spirit of enlightenment, or become fully enlightened in regard to the qualities of the Buddha?

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་ལ་བཀའ་སྩལ་པ།
en: The Buddha then said to the venerable Upāli,

source: །དེ་དག་ནི་མཁས་པ་དག་གིས་ཚོད་གཟུང་བར་བྱ་བ་མ་ཡིན་ཏེ།
en: They cannot be fathomed even by the wisest of men.

source: །ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་ལྟ་ཞོག་གི
en: Ānanda, look at the bodhisattvas.

source: །འཇམ་དཔལ་དེ་ལྟ་བས་ན་སོ་སོའི་སྐྱེ་བོ་རྣམས་ནི་དེ་བཞིན་གཤེགས་པ་ལ་བྱས་པ་གཟོའི། ཉན་ཐོས་རྣམས་ནི་བྱས་པ་གཟོ་བ་མ་ཡིན་ནོ།
en: “Therefore, Mañjuśrī, the ordinary individual is grateful to the Tathāgata, but the disciples are not grateful.

source: དེ་ལ་ཕྱིར་དམིགས་པར་མི་ནུས་སོ།
en: Thus, the disciples can never appreciate those qualities.

source: ཀུན་དགའ་བོ་ཁྱོད་ཞུམ་པའི་སེམས་མ་སྐྱེད་ཅིག
en: “Do not be discouraged, Ānanda!

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Buddha said,

source: དེ་བཞིན་དུ་ཀུན་ཏུ་སྦྱོར་བ་ཐམས་ཅད་སྤངས་པའི་ཉན་ཐོས་ལ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོན་ཏན་མེད་ཅིང་ནུས་པ་མེད་དེ།
en: in the same way all the qualities of the Buddha have no impression or effect on the disciples, who have abandoned all adherences

source: །འདི་ལྟ་སྟེ། དཔེར་ན་སྐྱེས་བུ་དབང་པོ་མ་ཚང་བ་ལ་འདོད་པའི་ཡོན་ཏན་ལྔ་ནི་ཡོན་ཏན་མེད་ཅིང་ནུས་པ་མེད་པ་སྟེ།
en: “Just as the five desire objects have no impression or effect on those bereft of faculties,

source: །བཅོམ་ལྡན་འདས་དེང་སླན་ཆད་བདག་མང་དུ་ཐོས་པའི་མཆོག་གོ་ཞེས་དམ་མི་འཆའོ།
en: “Lord, from this day forth, I shall no longer declare myself to be the foremost of the learned.”

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོར་མ་ཞུགས་པར་རིན་ཐང་མེད་པའི་རིན་པོ་ཆེར་ཕྱིན་པར་མི་ནུས་སོ།
en: Just as, noble sir, without going out into the great ocean, it is impossible to find precious, priceless pearls,

source: བདག་ཀྱང་སྤོབས་པ་མ་མཆིས་པར་གྱུར་ཏོ། །དེའི་སླད་དུ་བདག་སྐྱེས་བུ་དམ་པ་དེའི་བྲོ་འདྲི་ཞིང་མཆི་བར་མི་སྤྲོའོ།
en: As for me, I remained speechless, and therefore I am reluctant to go to that good man to inquire about his illness.”

source: །རིགས་ཀྱི་བུ་རྣམ་གྲངས་འདིས་ཉོན་མོངས་པ་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་རིགས་སུ་རིག་པར་བྱའོ།
en: Noble sir, through these considerations one can understand that all passions constitute the family of the tathāgatas.

source: །དེས་བདག་དང་སྐྱེས་བུ་དམ་པ་དེ་ལ་ཕྱག་བགྱིས་ཏེ་གུས་པར་སྨྲས་ནས་དེ་ཉིད་དུ་མི་གདའ་བར་གྱུར་ཏེ།
en: Having paid homage and respect both to me and to that good man, they disappeared.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཤེས་རབ་དང་སྤོབས་པ་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: and the wisdom and the eloquence of the tathāgatas are inconceivable.

source: །ཀུན་དགའ་བོ་དེ་ལྟར་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ནི་ཚད་མེད་དེ།
en: Thus, Ānanda, the enlightenment of the buddhas is immeasurable,

source: །འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ལ་ས་བོན་མི་སྐྱེའི།
en: Likewise, as seeds do not grow in the sky but do grow in the earth,

source: །དེ་ནས་ཚངས་པ་གཡོག་འཁོར་ཁྲིས་བསྟན་པ་འདི་ཐོས་ནས་ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: “Having heard these words, the ten thousand Brahmās were inspired with high resolve and conceived the spirit of unexcelled, perfect enlightenment.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་འདུས་མ་བྱས་ངེས་པ་ཐོབ་པའི་སེམས་ཅན་རྣམས་ལ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་མི་སྐྱེའོ། །ཉོན་མོངས་པའི་འདམ་དང་། ཆུ་གླིང་དུ་གྱུར་པའི་སེམས་ཅན་རྣམས་ལ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་སྐྱེའོ།
en: Just so, the buddha-qualities do not grow in living beings certainly destined for the uncreated but do grow in those living beings who are like swamps and mud banks of passions.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། སེམས་ཅན་རྣམ་པར་གྲོལ་བ་དང་།
en: their development and liberation of living beings,

source: །ཁ་ལོ་སྒྱུར་བ་བྱང་ཆུབ་སེམས།
en: Their driver is the spirit of enlightenment‌,

source: །ཐེག་པ་ཆེན་པོ་བླ་ན་མེད།
en: Their vehicle is the unexcelled Mahāyāna,

source: དེ་དག་ནི་མཉམ་པར་གཞག་པའི་གནས་ཀྱང་མི་འདོར་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱང་གཟིགས་ཏེ། གཉིས་ཀྱིས་རབ་ཏུ་ཕྱེ་བ་ཡང་མ་ཡིན་ནོ།
en: They see all the buddhafields without even leaving their state of concentration and without being affected by duality.’

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་འཇིག་རྟེན་ན་ལྷའི་མིག་ཅན་ཏེ།
en: ‘In the world, it is the buddhas who have the divine eye.

source: ཚངས་པ་དེ་ཡང་སྐྱེས་བུ་དམ་པ་དེ་ལས་བསྟན་པ་འདི་ཐོས་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: and Brahmā also was amazed to hear this teaching from that good man. Having bowed to him, he said,

source: ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་ཁྱོད་ཀྱིས་བདག་ཅག་གཉིས་ཀྱི་ཐེ་ཙོམ་སོལ་ཏེ་བདག་ཅག་གཉིས་ལྟུང་བ་ལས་ཕྱུང་ཤིག་ཅེས་མཆི་ནས།
en: Venerable Upāli, kindly remove our anxieties by absolving us of these infractions.’

source: །བཙུན་པ་ཉེ་བར་འཁོར་ཁྱོད་ཀྱིས་དགེ་སློང་འདི་གཉིས་ཀྱི་ལྟུང་བ་དེ་ཕྱིར་དམ་དུ་མི་བྱ།
en: ‘Reverend Upāli, do not aggravate further the sins of these two monks.

source: རྙོག་པ་ཅན་དུ་མི་བྱ་བར་འདི་གཉིས་ཀྱི་ལྟུང་བའི་འགྱོད་པ་སོལ་ཅིག
en: Without perplexing them, relieve their remorse.

source: །བཙུན་པ་ཉེ་བར་འཁོར་ལྟུང་བ་ནི་ནང་ན་ཡང་མི་གནས། ཕྱི་རོལ་དུ་ཡང་མི་འཕོས། གཉི་ག་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Reverend Upāli, sin is not to be apprehended within, or without, or between the two.

source: སེམས་ཀུན་ནས་ཉོན་མོངས་པས་སེམས་ཅན་ཀུན་ནས་ཉོན་མོངས་སོ།
en: “Living beings are afflicted by the passions of thought,

source: །སེམས་རྣམ་པར་བྱང་བས་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: and they are purified by the purification of thought.”

source: ཞི་བར་སོ་སོར་རྟོག་ཀྱང་ཤིན་ཏུ་ཞི་བའང་མི་སྐྱེད།
en: He considers peacefulness but does not seek extreme peace.

source: དབེན་པར་སོ་སོར་རྟོག་ཀྱང་ལུས་དང་སེམས་ཀྱིས་ཀྱང་འབད།
en: He cherishes solitude but does not avoid mental and physical efforts.

source: གཉི་ག་མེད་པར་ཡང་མི་དམིགས་སོ།
en: nor is it to be apprehended between the two.

source: འཁོར་བ་བསྟུང་བས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་བསྐལ་པ་ཡང་ཞག་བདུན་གྱིས་འདས་པར་སྟོན་ཏོ།
en: and he can make the passing of an eon seem like the passing of a week for those who are disciplined through a short period of evolution.

source: དེ་ལ་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་འཁོར་བ་ཚད་མེད་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་འདུལ་བའི་དབང་གི་ཕྱིར་ཞག་བདུན་ཡང་བསྐལ་པ་འདས་པར་སྟོན་ཏེ།
en: The bodhisattva who lives in the inconceivable liberation, for the sake of disciplining those living beings who are disciplined through immeasurable periods of evolution, can make the passing of a week seem like the passing of an eon,

source: གནས་མེད་པར་སོ་སོར་རྟོག་ཀྱང་དཀར་པོའི་ཆོས་ཀྱི་གནས་སྤོང་བའང་མ་ཡིན།
en: He considers placelessness but does not abandon the place of good actions.

source: །ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་ཇི་སྙེད་ཡོད་པ་དེ་ཐམས་ཅད་སྤུའི་ཁུང་བུ་གཅིག་ཏུ་སྟོན་ཏོ། །ཕྱོགས་བཅུ་ན་ཟླ་བ་དང་། ཉི་མ་དང་། སྐར་མའི་གཟུགས་ཇི་སྙེད་ཡོད་པ་དེ་ཐམས་ཅད་ཀྱང་སྤུའི་ཁུང་བུ་གཅིག་ཏུ་སྟོན་ཏོ།
en: He can display in a single pore all the offerings ever offered to all the buddhas of the ten directions, and the orbs of all the suns, moons, and stars of the ten directions.

source: འབྱུང་བ་མེད་པར་སོ་སོར་རྟོག་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་ཁུར་བླངས་པ་ཡང་ཐོགས།
en: He considers occurrencelessness but undertakes to bear the burdens of all living beings.

source: ཟག་པ་མེད་པར་སོ་སོར་རྟོག་ཀྱང་འཁོར་བའི་རྒྱུན་ལ་སློང་བར་ཡང་བྱེད།
en: He considers immaculateness, yet he follows the process of the world.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་གི་རྩྭ་དང་ནགས་ཚལ་རྣམས་ཉལ་བའང་མེད་དོ།
en: without letting the forests and the grasses of the buddhafields be flattened.

source: །ཕྱོགས་བཅུ་ན་རླུང་གི་དཀྱིལ་འཁོར་ལྡང་བ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཁའི་ནང་དུ་བརྔུབས་ཀྱང་དེའི་ལུས་ཞིག་པའང་མེད་ཅིང་
en: He can inhale all the hurricanes of the cosmic wind-atmospheres of the ten directions into his mouth without harming his own body and

source: །ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་བསྲེགས་པའི་བསྐལ་པས་ཚིག་པའི་མེའི་ཕུང་པོ་དེ་ཀུན་རང་གི་ལྟོར་བཅུག་ཀྱང་གང་དེས་ལས་བྱ་བ་དེའང་བྱེད་དོ།
en: He can take all the masses of fire of all the supernovas that ultimately consume all the universes of all the buddhafields into his stomach without interfering with their functions.

source: །འོག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་སྟེང་དུ་བྱུང་སྟེ་བཏེག་ནས།
en: Having crossed buddhafields as numerous as the sands of the Ganges downward, and having taken up a buddhafield,

source: །སེམས་ཇི་ལྟ་བར་ལྟུང་བའང་དེ་བཞིན་ནོ།
en: Sin is just the same as the mind,

source: ། ལྟུང་བ་ཇི་ལྟ་བར་ཆོས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ཏེ།
en: and all things are just the same as sin.

source: གྱེན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པར་སྟེང་དུ་འཇོག་སྟེ། འདི་ལྟ་སྟེ། དཔེར་ན་སྐྱེས་བུ་མཐུ་ཆེན་པོ་ཞིག་གིས་ཁབ་ཀྱི་རྩེ་མོས་རྒྱ་ཤུག་གི་ལོ་མ་ལ་བཙུགས་ཏེ་བཏེག་པ་བཞིན་ནོ།
en: he can rise up through buddhafields as numerous as the sands of the Ganges and place it on high, just as a strong man may pick up a jujube leaf on the point of a needle.

source: དེ་བཞིན་ཉིད་ལས་མི་འདའོ།
en: They do not escape this same reality.

source: །བཙུན་པ་ཉེ་བར་འཁོར་སེམས་ཀྱི་རང་བཞིན་གང་ཡིན་པ་དང་།
en: “ ‘Reverend Upāli, this nature of the mind,
